using System;

namespace HW._02
{
    class Program
    {
        static void Main(string[] args)
        {
        // 1.Добавить директиву Using System.IO для использования класса StreamReader.
        // 2.Использовать класс StreamReader для считывания текста из файла, с указанием пути к файлу.
        // 3.Прочитать все символы из указанного файла и преобразовать их в строку(string).
        // 4.Прекратить считывание символов из файла
        // 5.Создать массив для хранения частей строки(substrings), полученных путем деления строки из шага 3 на разряды.
        // 6.Создать массив для хранения байтов равный по длине массиву для хранения частей строки -1.
        // 7.Конвертировать части строки массива из шага 5 в байты
        // 8.Создать файл, содержащий массив байтов, полученных после конвертации, в указанную директорию.
        }
    }
}
